Revit 2027 API
FormatOptions.GetUnitTypeId Method
 Gets the identifier of the unit used to quantify values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetUnitTypeId()
Public Function GetUnitTypeId As ForgeTypeId
public:
ForgeTypeId^ GetUnitTypeId()
member GetUnitTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
Remarks
 Most units, such as square feet or degrees, are formatted as decimal decimal numbers. Other units may be displayed with specialized formatting methods like "feet and fractional inches" or "degrees, minutes and seconds".
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace